examples/naca0012_optimization_clean/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       39940;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       40020;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       40100;
    }
    bottom
    {
        type            patch;
        nFaces          100;
        startFace       40200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17440;
        startFace       40300;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1440;
        startFace       57740;
    }
)

// ************************************************************************* //
